/**
 * 회원관리 프로그램
 * <입력 및 출력형식>
 * ==== 회원관리 프로그램 ====
 * 1.회원등록
 * 2.회원목록보기
 * 3.회원정보수정
 * 4.회원정보삭제
 * 5.프로그램종료
 * =======================
 * 선택 ->
 * ====회원등록====
 * 등록할 회원의 정보를 입력.
 * 이름 = 
 * 주소 =
 * 전화 =
 * 나이 =
 * 성별 =
 * "이름" 회원님 등록을 환영합니다.
 * 
 * ====회원목록보기====
 * name : xx, address : xx, Phone : xx, age : xx, gender : xx
 * ......
 * ==================
 * ====회원정보수정====
 * 수정할 회원의 이름을 입력하세요.
 * 이름 = xxx
 * xxx 회원님의 정보를 수정합니다.
 * 이전 주소 = xx -> 변경주소 = 
 * 이전 전화 = xx -> 변경전화 = 
 * 이전 나이 = xx -> 변경나이 =
 * 이전 성별 = xx -> 변경성별 =
 * 
 * ====회원정보삭제====
 * 삭제할 회원의 이름을 입력하세요.
 * xxx 회원님의 정보가 삭제 되었습니다.
 * 
 * 
 * <패키지별 프로젝트 구성도>패기지명은 모두 소문자
 * mms.member.model : 한명의 회원에 대한 정보를 관리하는 클래스를 정의하는 패키지
 * (식당에서의 매니저)mms.member.ui : 회원관리 프로그램의 User Interface 역할을 담당하는 클래스가 정의된 패키지
 * mms.member.controller : 특정 메뉴가 선택되었을 때 요청을 직접받아서 처리하는 클래스가 정의된 패키지
 *                         프로그램 전체 흐름을 제어하는 역할을 수행하는 클래스 정의
 * mms.member.action : 사용자의 요청을 처리하는 역할을 수행하는 클래스 정의
 * mms.member.util : 콘솔로부터 사용자가 입력한 정보를 읽어 드리거나 콘솔로 필요한 메시지를 출력하는 역할
 *                   수행하는 클래스가 정의되어 있는 패키지 
 */
public class Comment {

}
