/**
 * 메서드(Method) : 자주 사용되는 명령어나 기능을 하나의 이름으로 
 *                 묶어서 관리하는 구조
 *                 - 자주 반복적으로 사용되는 명령어를 묶어서 사용하는 기능.
 *                 - 사용자 정의된 메서드는 반드시 호출을 통해서 실행.
 *                 - 콜백메서드(callback) : 시스템에 자동으로 호출되는 메서드
 *                 - 함수(Function) 
 *  1. 호출방법
 *     - Call By Name      : 이름에 의한 호출
 *                           메서드의 매개변수 없이 이름만 가지고 호출하는 행위
 *     - Call By Value     : 값에 의한 호출
 *                           메서드의 매개변수 값을 이용하여 호출하는 행위
 *     - Call By Reference : 참조(주소)에 의한 호출
 *                           ...
 *  2. 메서드의 4가지 유형
 *     - 결과형리턴값도 없고, 매개변수도 없는 형태(0.0)
 *     - 결과형리턴값은 없고, 매개변수는 있는 형태(0.1)
 *     - 결과형리턴값은 있고, 매개변수가 없는 형태(1.0)
 *     - 결과형리턴값은 있고, 매개변수도 있는 형태(1.1)
 *  3. 메서드의 형식
 *     접근제한자(지정자) [지정예약어] 결과형리턴값 메서드명(매개변수들)[throws 예외클래스들...]
 *        내용정의부;
 *     }
 *  4. 결과형리턴값
 *     - 메서드를 호출한 곳으로 되돌려주는 값을 뜻한다.
 *     - 키워드 : return
 *     - 종류
 *       void            : 되돌려 줄 값이 없음을 뜻한다.
 *       자바의 8대 자료형   : boolean, byte, char, short, int, long, float, double
 *       Reference 객체형 : 클래스명, 인터페이스명 등등
 */
public class Exam_01 {
	public static void main(String[] ar){
		
	}
}
