package employee;

public class Mondai {
/*
 * 상속관련 예제
 * 어떤 회사가 직원을 관리할 목적으로 "급여관리 시스템"을
 * 제작하려고 한다. 이 회사가 처음 프로그램을 구현할 때
 * 직원의 근무형태는 정규직(permament) 하나였다.
 * 
 * 1단계 Project. 정규직 직원을 관리하는 형태의 프로그램을 설계하시오.
 * 		조건 1. 정규직 직원을 관리할 목적의 클래스 Premament.
 * 					- 직원이름. 매달지급되는 급여액을 필드로.
 * 					- 생성자와 메서드는 알아서 구현하라.
 * 		조건 2. 처리를 담당하는 클래스 EmployeeManager.
 * 					- 새로운 직원을 등록 : AddEmployee 메서드
 * 					- 모든 직원의 급여정보 출력 : ShowAllSalaryInfo 메서드
 * 					- 이번달 지급될 급여의 총액 출력 : ShowTotalSalary.
 * 		조건 3. main 메서드를 가지고 있는 클래스는 별도로 구현한다.
 * 					1) 직원 관리를 목적으로 설계된 컨트롤 클래스 EmployeeManager의
 * 						객체생성.
 * 					2) 직원 3명 정도 등록.
 * 					3) 직원 급여의 내용 출력.
 * 					4) 이번 달 지급될 직원의 급여 총액 출력.
 */

	//오타확인 안함.
}
