package student.score;

/*
 * 학생성적을 관리하는 프로그램을 구현하시오.
 * <입력 및 출력형식>
 * ==== 학생관리 ====
 * 1. 학생성적등록
 * 2. 학생성적검색
 * 3. 학생성적수정
 * 4. 학생정보삭제
 * 5. 전체학생출력
 * 6. 프로그램종료
 * ==================
 * 선택 = 
 * 
 * ==== 학생성적등록 ====
 * 학번 =
 * 이름 =
 * 국어 =
 * 영어 =
 * 수학 =
 * 
 * ==== 학생성적검색 ====
 * 검색할 학생의 학번을 입력하세요.
 * 학번 =
 * 
 * 학번 : xx, 이름 : xx, 국어 : xx, 영어 : xx, 수학 : xx, 총점 : xx, 평균 : xx 
 * 
 * ==== 학생성적수정 ====
 * 수정할 학생의 학번을 입력하세요.
 * 학번 =
 * 
 * 국어 =
 * 영어 =
 * 수학 =
 * 
 * ==== 학생성적삭제 ====
 * 삭제할 학생의 학번을 입력하세요.
 * 학번 =
 * 
 * ==== 전체학생출력 ====
 * 학번 : xx, 이름 : xx, 국어 : xx, 영어 : xx, 수학 : xx, 총점 : xx, 평균 : xx 
 * 학번 : xx, 이름 : xx, 국어 : xx, 영어 : xx, 수학 : xx, 총점 : xx, 평균 : xx 
 * 
 * <처리조건>
 * 1. 한명의 학생에 대한 기본정보를 저장하기 위한 클래스 Student를 알맞게 구현하시오.
 * 2. 둘 이상의 학생에 대한 정보를 관리하기위해 Collection FrameWork중 알맞은 것을 사용하시오.
 * 3. 처리를 담당하는 클래스를 StudentManager로 구현한 후 필드와 메서드를 적절하게 구현하시오.
 * 4. 주어진 입출력형식에 맞게 프로그램이 동작하도록 구현하시오.
 * 5. 학번은 중복되지 않도록 구현하되, 기존에 있는 학번이면 재입력받고, 존재하지 않은 학번이
 *    입력되면 오류메시지 '입력한 학번은 존재하지 않습니다.'가 출력되도록 구현하시오.
 * 6. 기타 조건은 프로그램의 흐름에 맞게 구현하시오.
 * */
public class Note {

}
