/*
 * 성적 처리 프로그램
 * 1단계 : 국어, 영어, 수학 점수를 입력받아 총점과 평균을 계산하여 출력하시오./10점
 *         처리조건1.
 *         평균은 소숫점이하 둘째자리까지 표현할 것. /5점
 * 2단계 : 
 *         처리조건2.
 *         평균을 이용하여 학점을 구현하되, 90점 이상이면 'A', 80점 이상이면 'B', 70점 이상이면 ' C',
 *         60점 이상이면 'D', 그외에 'F'학점으로 표현할 것. /10점
 *         switch~case문을 이용할 것 / 5점
 * 3단계 :
 *         처리조건3.
 *         각 과목의 점수는 0 ~ 100 사이만 입력받되, 범위를 벗어나면 다시 입력받도록 구현한다. / 10점
 * 4단계 :
 *         처리조건4.
 *         과목의 점수를 배열로 받아 처리할 것 / 15점
 * 5단계 :
 *         처리조건5.
 *         3명의 성적을 받아 총점과 평균을 계산하여 출력하는 프로그램으로 확장할 것./20점
 * 6단계 :
 *         처리조건6.
 *         한명의 성적을 계산하는 Student 클래스를 구현하여 성적처리 프로그램을 수행할 것. / 25점          
 * 7단계 :
 *         처리조건7. 
 *         
 *         다음과 같은 프로그램이 수행되도록 구현하시오.
 *         <성적처리프로그램>
 *         1. 학생등록
 *         2. 성적검색
 *         3. 성적수정
 *         4. 전체학생 성적보기
 *         5. 프로그램 종료
 *         메뉴(1~5) = 1
 *         
 *         ==== 학생등록 ====
 *         학번 =
 *         성명 = 홍길동
 *         국어 =
 *         영어 =
 *         수학 =
 *         홍길동군의 성적이 등록되었습니다.
 *         
 *         ==== 성적검색 ====
 *         성적을 검색할 학생의 이름을 입력하세요.
 *         성명 = 김길동
 *         
 *         학번  성명  국어  영어  수학  총점  평균  학점
 *         -----------------------------------------------
 *          xx   김길동  xx    xx    xx    xx    xx.xx  xx 
 *          
 *        ==== 성적수정 ====
 *        성적을 수정할 학생의 이름을 입력하세요.
 *        성명 = 이길동
 *        
 *        이전 국어 = xx , 수정 국어 =
 *        이전 영어 = xx , 수정 영어 =
 *        이전 수학 = xx , 수정 수학 =
 *          
 *        ==== 전체 학생 성적보기 ====
 *        학번  성명  국어  영어  수학  총점  평균  학점
 * 		  ----------------------------------------------
 * 		   xx  홍길동  xx    xx     xx    xx   xx.xx  xx
 *                 
 * */
public class Test_01 {

}
