package tutorial10;
/*
 * 계좌 관리 프로그램
 * <입력 및 출력형식>
 * =====MENU=====
 * 1. 계좌개설
 * 2. 입금처리
 * 3. 출금처리
 * 4. 전체고객 잔액보기
 * 5. 프로그램 종료
 * ==============
 * 선택 1
 * ====계좌개설===
 * 계좌번호 = 
 * 고객이름 = 
 * 예금금액 = 
 * 계좌개설이 완료되었습니다.
 * =====MENU=====
 * 1. 계좌개설
 * 2. 입금처리
 * 3. 출금처리
 * 4. 전체고객 잔액보기
 * 5. 프로그램 종료
 * ==============
 * 선택 2
 * ===입금처리====
 * 계좌번호 = 
 * Tip> 이때 계좌번호가 존재하지 않으면 작업을 닫는다.
 * 입금금액 =
 * 입금처리가 완료되었습니다.
 * 고객님의 현재잔액은 xxxx원입니다.
 * =====MENU=====
 * 1. 계좌개설
 * 2. 입금처리
 * 3. 출금처리
 * 4. 전체고객 잔액보기
 * 5. 프로그램 종료
 * ==============
 * 선택 = 3
 * ====출금처리====
 * 계좌번호 = 
 * Tip> 존재하지 않은 계좌번호를 입력하면 오류메세지를 출력하고 작업을 닫는다.
 * 출금금액 = 
 * Tip> 출금금액이 예금잔액보다 크면 "잔액이 부족합니다."라는 메시지 출력 후 닫는다.
 * 출금처리가 완료되었습니다.
 * 고객님의 현재 잔액은 xxxx원입니다.
 * =====MENU=====
 * 1. 계좌개설
 * 2. 입금처리
 * 3. 출금처리
 * 4. 전체고객 잔액보기
 * 5. 프로그램 종료
 * ==============
 * 선택 =4
 * ====전체고객 잔액현황 =====
 * 계좌 번호 : xx, 고객이름 : xx, 예금잔액 : xx
 * 
 */
import java.io.*;

public class BankingSystem {
	static final int MAX=50;
	
}
