package Note;
/*
 * 학생관리 프로그램
 * 다음과 같은 처리조건에 만족하는 프로그램을 구현
 * 
 * <입출력>
 * ====학생관리프로그램====
 * 1. 학생등록
 * 2. 학생검색
 * 3. 학생수정
 * 4. 학생삭제
 * 5. 전체학생
 * 6. 종료
 * ======================
 * 
 * 학생등록
 * 학번-
 * 이름-
 * 국어-
 * 영어-
 * 수학-
 * xxx 등록 완료!!!
 * 
 * ====학생겁색====
 * 학번입력 - 
 * 이름 : , 국어 : , 영어 : , 수학 : , 총점 : .
 * 
 * ====학생수정====
 * 학번 - 
 * 이름 xxx -> 
 * 국어 xxx -> 
 * 영어 xxx ->
 * 수학 xxx ->
 * xxx수정완료!!!!
 * 
 * ====학생삭제====
 * 학번 - 
 * xxx학생 삭제!!!
 * 
 * ====전체학생====
 * 이름 : , 국어 : , 영어 : , 수학 : , 총점 : .
 * ....
 * ...
 * ..
 * 
 * <처리조건>
 * 1. 학생 한명의 정보를 관리할 목적의 클래스 Student를 구현
 *    멤버필드와 멤버메서드 그리고 생성자는 필요에 맞게 구현
 * 2. 둘 이상의 학생에 대한 정보를 관리하기 위해 객체배열 이용.
 * 
 * 3. 주어진 입출력양식에 맞추기
 * 
 */
public class Note_02 {

}
